УчетВУправляющихДляГит1/src/InformationRegisters/ЖурналОтправокВКонтролирующиеОрганы/ЖурналОтправокВКонтролирующиеОрганы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтправокВКонтролирующиеОрганы</name>
  <resources>
    <name>СтатусОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтролирующегоОргана</name>
    <type>
      <types>EnumRef.ТипыКонтролирующихОрганов</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСдачиОтчетности</name>
    <type>
      <types>EnumRef.СостояниеСдачиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОтправляетсяВКонтролирующийОрган</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКритическиеОшибкиОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Непрочтенное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПриcоединенныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтраницаЖурнала</name>
    <type>
      <types>EnumRef.СтраницыЖурналаОтчетность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/СтраницыЖурналаОтчетность/СтраницыЖурналаОтчетность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтраницыЖурналаОтчетность</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>Отчеты</name>
  </enumValues>
  <enumValues>
    <name>Уведомления</name>
  </enumValues>
  <enumValues>
    <name>Письма</name>
  </enumValues>
  <enumValues>
    <name>Сверки</name>
  </enumValues>
  <enumValues>
    <name>ЕГРЮЛ</name>
  </enumValues>
  <enumValues>
    <name>Входящие</name>
  </enumValues>
  <enumValues>
    <name>Настройки</name>
  </enumValues>
  <enumValues>
    <name>Сервисы</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/InformationRegisters/ЖурналОтправокВКонтролирующиеОрганы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Обработчик обновления БРО 1.1.11.8
//
Процедура ИзменитьСтатусыНеОтправлявшихсяУведомлений(Параметры = Неопределено) Экспорт
	
	ВыборкаЖОКО = РегистрыСведений.ЖурналОтправокВКонтролирующиеОрганы.Выбрать(
	Новый Структура("СтраницаЖурнала", Перечисления.СтраницыЖурналаОтчетность.Уведомления));
	
	Пока ВыборкаЖОКО.Следующий() Цикл
		
		Если НЕ РегламентированнаяОтчетностьКлиентСервер.ОбъектНеОтправлялсяЧерез1СОтчетность(
			ВыборкаЖОКО.СостояниеСдачиОтчетности) Тогда
			Продолжить;
		КонецЕсли;
		
		СтатусыОбъекта
		= РегламентированнаяОтчетностьКлиентСервер.СтатусыОбъектовРеглОтчетностиПриРучномВводе(
		ВыборкаЖОКО.Ссылка);
		
		ТекСтатус = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1'"), ВыборкаЖОКО.СтатусОтправки);
		
		Если СтатусыОбъекта.Найти(ТекСтатус) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьЖОКО = ВыборкаЖОКО.ПолучитьМенеджерЗаписи();
		ЗаписьЖОКО.СтатусОтправки = НСтр("ru = 'В работе'");
		ЗаписьЖОКО.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
